---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document..::..NewDimension Method
Document Class See Also Send Feedback
---

Creates a new linear dimension object.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | NewDimension(View, Line, ReferenceArray) | Creates a new linear dimension object using the default dimension style. (Inherited from ItemFactoryBase.) |
|  | NewDimension(View, Line, ReferenceArray, DimensionType) | Creates a new linear dimension object using the specified dimension style. (Inherited from ItemFactoryBase.) |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace